<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8" >
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>БАЗА ПО GIT</title>
</head>

<body>
    <header>
    <p> <a href="index.html"> <img src="images/photo.jpg" width="100" title="BAZA" alt="BAZA"/> </a> - перейти на <i><u>главную</u></i></p>
        <h1>БАЗА ПО GIT</h1>
    </header>
    <main>
        <h2>ЗАУМНЫЕ СЛОВЕЧКИ</h2>
        <p> <b>форк (fork)</b> - копия репозитория - внешняя ветка гит-репозитория </p>
        <p><b>Обновиться из апстрима</b> - обновить свою локальную версию форка до последней версии основного репозитория, от которого был сделан форк</p>
        <p><b>обновиться из ориджина</b> - обновить свою локальную версию репозитория до последней удаленной версии основного репозитория</p>
        <p><b>ветка (branch)</b> - параллельная версия репозитория, при этом она включена в этот репозиторий, но не влияет на главную версию, поэтому в ней можно спокойно работать и и позже объединить с основной версией</p>
        <p><b>мастер (master)</b> - главная / основная ветка</p>
        <p><b>комит (commit)</b> - фиксация изменений</p>
        <p> <b> пул (pull) </b> - получение последних изменений с удаленного сервера репозитория </p>
        <p><b>пуш (push)</b> - отправка всех неотправленных комитов на удаленный сервер репозитория</p>
        <p><b>пулреквест (pull request)</b> - запрос на слияние форка с мастером - может быть принят или отклонен владельцем</p>
        <p><b>мёрдж (merge)</b> - слияние изменений из какой-любой ветки репозиторрия с любой веткой этого же репозитория </p>
        <p><b>кодревью</b> - проверка кода на определнные требования, задачи и внешнему виду</p>

        <h2>КОМАНДЫ</h2>
        <p><b>pull</b> (- тянуть) - получение последней версии проекта</p>
        <p><b>push</b>(- толкать) - отправка изменений в облако</p>
    </main>
</body>
</html>